stonenumber=0
if stonenumber>=6:
    print('你拥有了毁灭宇宙的力量')
elif 0<stonenumber<=5:
    print('绯红女巫需要亲手毁掉幻视额头上的心灵宝石')
else :
    print('需要惊奇队长逆转未来')

    #当宝石数量为0颗的时候，可以输出"需要惊奇队长逆转未来"

#================================================================
stonenumber=0
#为宝石数量赋值

if stonenumber>=6:
    #条件：如果你拥有的宝石数量大于等于6个

    print('你拥有了毁灭宇宙的力量')
    #结果：显示‘就拥有了毁灭宇宙的力量’的结果
    
elif 0<stonenumber<=5:
# 条件：如果想让宝石数量停留在5个以下，至少一个

    print('绯红女巫需要亲手毁掉幻视额头上的心灵宝石')
     #结果：显示‘绯红女巫需要亲手毁掉幻视额头上的心灵宝石’的结果

# 条件：当赋值不满足if和elif条件时，执行else下的命令，宝石数量为0个
else:
    
    #结果：显示‘需要惊奇队长逆转未来’的结果
    print('需要惊奇队长逆转未来')
#===================================================
historyscore=26
#赋值语句：为历史成绩赋值

if historyscore>=60:
    #条件：当历史成绩大于等于60时：

    print('你已经及格')

else:
    #条件：当历史成绩小于60时

    print('不及格')
    #结果：输出不及格的结果

print('程序结束')
#打印最终结果
#===========================================================
money=80
if money<=500:
    print('欢迎进入史塔克穷人帮前三名')
    if money>100:
        print('请找弗瑞队长加薪')
    if money<=100:
        print('恭喜您荣获“美元队长”称号！')
elif money<=1000:
    print('祝贺您至少可以温饱了。')
else :
    print('经济危机都难不倒您！')
    if money<=20000:
        print('您快比钢铁侠有钱了！')
    else :
        print('您是不是来自于瓦坎达国？')
print('程序结束')
#=========================================================